Tutorials-2.3.0/incompressible/circularChannel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.68369 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value		uniform (0.68369 0 0);
    }
    
    outlet
    {
	type		zeroGradient;
    }
    
    walls
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }
    
    wedge1
    {
        type            wedge;
    }

    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
